app/admin/posts.rb

  scope :unpublished

  form do |f|
    inputs "Details" do
      input :user
      input :title
      input :body
    end
    actions
  end

  action_item :publish, only: :show do
    link_to "Publish", publish_admin_post_path(post), method: :put if !post.published_at?
  end

  action_item :unpublish, only: :show do
    link_to "Unpublish", unpublish_admin_post_path(post), method: :put if post.published_at?
  end

  member_action :publish, method: :put do
    post = Post.find(params[:id])
    post.update(published_at: Time.zone.now)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "published_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["published_at", nil], ["updated_at", "2022-04-07 03:49:29.479675"], ["id", 1]]